React_Module_Scripts/React_Api_Preferred_Substitute/Absence_React_api_Test.yml
execution:
#- executor: jmeter
- concurrency: 50
  ramp-up: 50s
  hold-for: 50m
  scenario: SC04_Preferred_Substitutes_Api

scenarios:
  SC04_Preferred_Substitutes_Api:
    script: SC04_Preferred_Substitutes_Api.jmx

modules:
  console:
    disable: true # disable runtime console reporter

reporting:
#- module: console
- module: passfail
  criteria:
  - avg-rt>10s for 30s, stop as failed
  - fail>50% for 20s, stop as failed